Task 1: Working with Series

1. Create a Pandas Series from the following list:
data = [25, 30, 35, 40, 45]
2. Write a Python program to:
- Assign custom indices ['A', 'B', 'C', 'D', 'E'] to the Series.
- Display the first three elements of the Series.
- Calculate the mean, median, and standard deviation of the
Series.

In [2]:
import numpy as np
import pandas as pd
data = [25, 30, 35, 40, 45]
series=pd.Series(data,index=['A', 'B', 'C', 'D', 'E'])
print("Panda series with custom indices:")
print(series)

Panda series with custom indices:
A    25
B    30
C    35
D    40
E    45
dtype: int64

In [3]:
series.head(3)

A    25
B    30
C    35
dtype: int64

In [4]:
print("Mean:",series.mean())
print("Median:",series.median())
print("Standard deviation:",series.std())

Mean: 35.0
Median: 35.0
Standard deviation: 7.905694150420948

Task 2: Creating and Inspecting DataFrames

1. Create a Pandas DataFrame with the following data:
Name Age Gender Marks
Alice 20 Female 85
Bob 22 Male 78
Carol 19 Female 92
David 21 Male 74
Eve 20 Female 88
2. Write a Python program to:
- Display the first two rows of the DataFrame.
- Display the column names, data types, and summary statistics.
- Add a new column Passed that contains True if Marks >= 80
and False otherwise.

In [5]:
data = {
    'Name': ['Alice', 'Bob', 'Carol', 'David', 'Eve'],
    'Age': [20, 22, 19, 21, 20],
    'Gender': ['Female', 'Male', 'Female', 'Male', 'Female'],
    'Marks': [85, 78, 92, 74, 88]
}
df=pd.DataFrame(data)
df.head(2)

    Name  Age  Gender  Marks
0  Alice   20  Female     85
1    Bob   22    Male     78

In [6]:
print("Column Names:")
print(df.columns.tolist())
print()

print("Data Types:")
print(df.dtypes)
print()

print("Summary Statistics:")
print(df.describe(include='all'))
print()

Column Names:
['Name', 'Age', 'Gender', 'Marks']

Data Types:
Name      object
Age        int64
Gender    object
Marks      int64
dtype: object

Summary Statistics:
         Name        Age  Gender      Marks
count       5   5.000000       5   5.000000
unique      5        NaN       2        NaN
top     Alice        NaN  Female        NaN
freq        1        NaN       3        NaN
mean      NaN  20.400000     NaN  83.400000
std       NaN   1.140175     NaN   7.334848
min       NaN  19.000000     NaN  74.000000
25%       NaN  20.000000     NaN  78.000000
50%       NaN  20.000000     NaN  85.000000
75%       NaN  21.000000     NaN  88.000000
max       NaN  22.000000     NaN  92.000000

In [7]:
df['Passed'] = df['Marks'] >= 80
print("DataFrame with 'Passed' column:")
df

DataFrame with 'Passed' column:

    Name  Age  Gender  Marks  Passed
0  Alice   20  Female     85    True
1    Bob   22    Male     78   False
2  Carol   19  Female     92    True
3  David   21    Male     74   False
4    Eve   20  Female     88    True

Task 3: Data Selection and Filtering

1. Using the DataFrame from Task 2, write a Python program to:
- Select and display the Name and Marks columns.
- Filter and display records where Marks > 80.
- Display the record of the student with the highest marks.

In [8]:
df=pd.DataFrame(data)
df

    Name  Age  Gender  Marks
0  Alice   20  Female     85
1    Bob   22    Male     78
2  Carol   19  Female     92
3  David   21    Male     74
4    Eve   20  Female     88

In [9]:
new_df=pd.DataFrame(data,columns=['Name','Marks'])
print("Name and marks columns are:")
new_df

Name and marks columns are:

    Name  Marks
0  Alice     85
1    Bob     78
2  Carol     92
3  David     74
4    Eve     88

In [10]:
print("Records where marks<=80 are:")
df1=df[df['Marks']>80]
df1

Records where marks<=80 are:

    Name  Age  Gender  Marks
0  Alice   20  Female     85
2  Carol   19  Female     92
4    Eve   20  Female     88

In [11]:
print("Student who scored maximum marks is:")
max_marks=df['Marks'].max()
student=df[df['Marks']==max_marks]
student

Student who scored maximum marks is:

    Name  Age  Gender  Marks
2  Carol   19  Female     92

Task 4: Handling Missing Data

1. Modify the DataFrame from Task 2 by introducing missing values:
2. df.loc[1, 'Marks'] = None
3. df.loc[4, 'Age'] = None
4. Write a Python program to:
- Identify missing values in the DataFrame.
- Fill missing values in the Marks column with the column's
mean.
- Drop rows where the Age column has missing values.

In [12]:
df = pd.DataFrame(data)

df.loc[1, 'Marks'] = None  # Set Bob's Marks to None
df.loc[4, 'Age'] = None    # Set Eve's Age to None

print("DataFrame with missing values:")
print(df)
print()

print("Missing value locations (True means missing):")
print(df.isnull())
print()

mean_marks = df['Marks'].mean()
df['Marks'].fillna(mean_marks, inplace=True)

print("DataFrame after filling missing 'Marks' with mean:")
print(df)
print()

df.dropna(subset=['Age'], inplace=True)
print("Final DataFrame after dropping rows with missing 'Age':")
print(df)

DataFrame with missing values:
    Name   Age  Gender  Marks
0  Alice  20.0  Female   85.0
1    Bob  22.0    Male    NaN
2  Carol  19.0  Female   92.0
3  David  21.0    Male   74.0
4    Eve   NaN  Female   88.0

Missing value locations (True means missing):
    Name    Age  Gender  Marks
0  False  False   False  False
1  False  False   False   True
2  False  False   False  False
3  False  False   False  False
4  False   True   False  False

DataFrame after filling missing 'Marks' with mean:
    Name   Age  Gender  Marks
0  Alice  20.0  Female  85.00
1    Bob  22.0    Male  84.75
2  Carol  19.0  Female  92.00
3  David  21.0    Male  74.00
4    Eve   NaN  Female  88.00

Final DataFrame after dropping rows with missing 'Age':
    Name   Age  Gender  Marks
0  Alice  20.0  Female  85.00
1    Bob  22.0    Male  84.75
2  Carol  19.0  Female  92.00
3  David  21.0    Male  74.00

C:\Users\hp\AppData\Local\Temp\ipykernel_18340\1319052707.py:15: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Marks'].fillna(mean_marks, inplace=True)

Task 5: Grouping and Aggregation

1. Using the DataFrame from Task 2, write a Python program to:
- Group the data by Gender and calculate the mean age and
marks for each gender.
- Count the number of students in each gender group.

In [14]:
df = pd.DataFrame(data)

groupMeans = df.groupby('Gender')[['Age', 'Marks']].mean()
print(groupMeans)

              Age      Marks
Gender
Female  19.666667  88.333333
Male    21.500000  76.000000

In [15]:
groupCounts = df['Gender'].value_counts()
print(groupCounts)

Gender
Female    3
Male      2
Name: count, dtype: int64

Task 6: Reading and Writing Data

1. Write a Python program to:
- Save the modified DataFrame from Task 4 to a CSV file named
students_data.csv.
- Read the CSV file into a new DataFrame.
- Display the first five rows of the newly loaded DataFrame.

In [16]:
data = {
    'Name': ['Alice', 'Bob', 'Carol', 'David', 'Eve'],
    'Age': [20, 22, 19, 21, None],
    'Gender': ['Female', 'Male', 'Female', 'Male', 'Female'],
    'Marks': [85, None, 92, 74, 88]
}
df = pd.DataFrame(data)
df

    Name   Age  Gender  Marks
0  Alice  20.0  Female   85.0
1    Bob  22.0    Male    NaN
2  Carol  19.0  Female   92.0
3  David  21.0    Male   74.0
4    Eve   NaN  Female   88.0

In [19]:
df.to_csv("students_data.csv", index=False)
df_loaded = pd.read_csv("students_data.csv")
df_loaded

    Name   Age  Gender  Marks
0  Alice  20.0  Female   85.0
1    Bob  22.0    Male    NaN
2  Carol  19.0  Female   92.0
3  David  21.0    Male   74.0
4    Eve   NaN  Female   88.0

In [18]:
df_loaded.head(5)

    Name   Age  Gender  Marks
0  Alice  20.0  Female   85.0
1    Bob  22.0    Male    NaN
2  Carol  19.0  Female   92.0
3  David  21.0    Male   74.0
4    Eve   NaN  Female   88.0

Task 7: General

1. Download a sample dataset from Kaggle or use any public dataset.
2. Write a Python program to:
- Load the dataset using Pandas.
- Perform exploratory data analysis (EDA) by summarizing key
statistics, checking for missing values, and visualizing data
trends using Matplotlib or Seaborn.
- Document your findings in Markdown or comments.

In [21]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

# Load the Iris dataset
df = sns.load_dataset('iris')
df.to_csv("iris_dataset.csv", index=False)

print("First 5 rows of the dataset:")
print(df.head())
print("The Shape of the dataset is:", df.shape)

First 5 rows of the dataset:
   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
The Shape of the dataset is: (150, 5)

In [22]:
print("Data Types are:")
print(df.dtypes)

Data Types are:
sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

In [23]:
print("Summary Statistics:")
print(df.describe(include='all'))

Summary Statistics:
        sepal_length  sepal_width  petal_length  petal_width species
count     150.000000   150.000000    150.000000   150.000000     150
unique           NaN          NaN           NaN          NaN       3
top              NaN          NaN           NaN          NaN  setosa
freq             NaN          NaN           NaN          NaN      50
mean        5.843333     3.057333      3.758000     1.199333     NaN
std         0.828066     0.435866      1.765298     0.762238     NaN
min         4.300000     2.000000      1.000000     0.100000     NaN
25%         5.100000     2.800000      1.600000     0.300000     NaN
50%         5.800000     3.000000      4.350000     1.300000     NaN
75%         6.400000     3.300000      5.100000     1.800000     NaN
max         7.900000     4.400000      6.900000     2.500000     NaN

In [24]:
print("Missing Values:")
print(df.isnull().sum())

Missing Values:
sepal_length    0
sepal_width     0
petal_length    0
petal_width     0
species         0
dtype: int64